const FootprintIcon = (props) => {
  return (
    <svg
      width="20"
      height="20"
      className="w-5 inline-block transition-transform group-hover:rotate-[20deg]"
      viewBox="0 0 800 800"
      fill="currentColor" // Ensures color adapts to the parent text color
      {...props}
    >
      <g id="页面-1">
        <g id="Development" transform="translate(0.000000, -48.000000)">
          <g id="code_fill" transform="translate(0.000000, 48.000000)">
            <path
              id="形状"
              d="M449.2,121c27.2,4.8,45.4,30.7,40.6,57.9l-81,459.6c-4.8,27.2-30.7,45.4-57.9,40.6
                c-27.2-4.8-45.4-30.7-40.6-57.9l81-459.6C396.1,134.3,422,116.2,449.2,121z M252,223.2c19.5,19.5,19.5,51.2,0,70.7L146,400
                L252,506.1c19.5,19.5,19.5,51.2,0,70.7c-19.5,19.5-51.2,19.5-70.7,0L39.9,435.3c-9.4-9.4-14.6-22.1-14.6-35.4
                c0-13.3,5.3-26,14.6-35.4l141.4-141.4C200.8,203.7,232.5,203.7,252,223.2z M618.7,223.2l141.4,141.4c9.4,9.4,14.6,22.1,14.6,35.4
                c0,13.3-5.3,26-14.6,35.4L618.7,576.8c-19.5,19.5-51.2,19.5-70.7,0s-19.5-51.2,0-70.7L654,400L548,293.9
                c-19.5-19.5-19.5-51.2,0-70.7C567.5,203.7,599.2,203.7,618.7,223.2z"
            />
          </g>
        </g>
      </g>
    </svg>
  );
};

export default FootprintIcon;
